# "Создание словаря товара"
#
# Создайте словарь, представляющий товар, с ключами "название", "цена" и "количество".
# Присвойте ключам произвольные значения.

# 1. Выведите словарь на экран.
# 2. Выведите на экран название товара и его цену, используя ключи словаря

item = {
    "name": "Брюки",
    "cost": 35,
    "quantity": 10
}

print(item)
print(item["name"])