# "Создание словаря товара"
#
# Создайте словарь, представляющий товар, с ключами "название", "цена" и "количество".
# Присвойте ключам произвольные значения.

# 1. Выведите словарь на экран.
# 2. Выведите на экран название товара и его цену, используя ключи словаря

item = {
<<<<<<< HEAD
    "name" : "paints",
    "price": 35,
    "quantity": 10
}
=======
    "name": "Брюки",
    "cost": 35,
    "quantity": 10
}

>>>>>>> 8af6c69ec3c36c1cceefae84eb65ee6b4d851b53
print(item)
print(item["name"])