# "Добавление нового ключа в словарь"
#
# Создайте словарь товара с ключами "название", "цена" и "количество".
# Добавьте новый ключ "производитель" и присвойте ему значение.
# Выведите обновленный словарь на экран.
<<<<<<< HEAD
item = {
    "name" : "paints",
    "price": 35,
    "quantity": 10
}
item["brand"] = "abibas"
=======

item = {
    "name": "Брюки",
    "cost": 35,
    "quantity": 10
}

item["brand"] = "Abibas"

>>>>>>> 8af6c69ec3c36c1cceefae84eb65ee6b4d851b53
print(item)