# Дан код переводящий километры в мили:
kilometers = [10, 20, 30, 40]
# miles = []
# for km in kilometers:
#     miles.append(km * 0.621371)
# print(miles)

# Перепишите его, используя list comprehensions:

miles = [km * 0.621371 for km in kilometers]
print(miles)