# Дан код:
numbers = [1, 2, 3, 4]
pairs = []
for num in numbers:
    pairs.append((num, num ** 2))
print(pairs)

# Перепишите его, используя list comprehensions:

...