# Дана строка.
# Найти длину самой длинной подстроки без повторяющихся символов.
string = "Идея в том, чтобы смотря в pycharm на название папки сразу понимать , где искать, то что хочется по быстрому найти и посмотреть например примеры. Краткое название, без необходимости открывать доп. файл. в принципе название тем есть и на странице в гисте, но это все доп. движения а их хотелось бы избежать. краткое дополнение помогло бы. мы просто бы смотрели по названиям каталогов в pycharm и сразу находили бы в какой урок надо зайти, чтобы посмотреть примеры или сделанные задания."
string1 = ""
list_= []
for i, el in enumerate(string, ):
    if el[i] != el[i+1]:
        string1 += el[i]
    else:
        string1 += el[i]
        break
    list_.append(string1)
list_.sort()
rez = list_[0]

print(rez)
