# "Генератор слов из строки"
#
# Входные данные: Строка text.
# Результат: Генератор, выдающий по одному слову из входной строки.

def words_from_string(text: str):
    """
    Генератор, выдающий по одному слову из входной строки.
    """
    # Допишите ваш код здесь
    # for word in "мама мыла раму".split()
    pass

# Пример использования:
# for word in words_from_string("Это пример строки для генератора"):
#     print(word)
