# "Фильтрация списка строк по определенному префиксу"
#
# Дан список строк. Необходимо отфильтровать этот список,
# оставив только те строки, которые начинаются с префикса "log_".

logs = ["info: Server started", "log_error: File not found", "warning: Low disk space", "log_debug: Variable x = 5"]
prefix = "log_"

result = list(filter(lambda s: s.startswith(prefix), logs))
print(result)