# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
sting = ''
i = 0
while i < len(names):
    sting += names[i] + ", "
    i += 1
print(sting[:-2])

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
