# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("введите текст ")
punct = text.count(".")
comma = text.count(",")
if punct > comma:
    print('точек больше')
elif comma > punct:
    print('запятых больше')
else:
    print('одинаково')